       IDENTIFICATION DIVISION. 
       PROGRAM-ID. Bibliotheque.
       AUTHOR. Anais & Bernadette.


       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FICHIER-LIVRES ASSIGN TO 'livres-input.txt'
              ORGANIZATION IS LINE SEQUENTIAL
              FILE STATUS IS F-LIVRES-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD FICHIER-LIVRES.
       01 LIGNE-FICHIER-LIVRES.
           05 F-CODE-ISBN             PIC X(13).
           05 F-TITRE                 PIC X(38).
           05 F-NOM-AUTEUR            PIC X(22).
           05 F-PRENOM-AUTEUR         PIC X(22).
           05 F-GENRE-LIVRE           PIC X(16).
           05 F-ANNEE-PUB             PIC X(04).
           05 F-EDITEUR               PIC X(20).


       WORKING-STORAGE SECTION.

OCESQL*EXEC SQL BEGIN DECLARE SECTION END-EXEC.

       01 S-CODE-ISBN                PIC X(13).
       01 S-TITRE                    PIC X(50).  
       01 S-NOM-AUTEUR               PIC X(22).
       01 S-PRENOM-AUTEUR            PIC X(22).
       01 S-GENRE-LIVRE              PIC X(50).
       01 S-ANNEE-PUB                PIC X(04).
       01 S-EDITEUR                  PIC X(50).

       01 S-ID-GENRE                 PIC 9(10).
       01 S-ID-AUTEUR                PIC 9(10).
       

       01  USERNAME       PIC X(30) VALUE "postgres".
       01  PASSWD         PIC X(30) VALUE "postgres".
       01  DBNAME         PIC X(20) VALUE "gestion_bibliotheque".

OCESQL*EXEC SQL END DECLARE SECTION END-EXEC.
       
OCESQL*EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".


       01  F-LIVRES-STATUS         PIC X(02) VALUE SPACE.
           88 F-LIVRES-STATUS-OK   VALUE '00'.
           88 F-LIVRES-STATUS-EOF  VALUE '10'.


OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(039) VALUE "INSERT INTO genre (genre) VALU"
OCESQL  &  "ES ( $1 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0002.
OCESQL     02  FILLER PIC X(043) VALUE "SELECT id_genre FROM genre WHE"
OCESQL  &  "RE genre = $1".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0003.
OCESQL     02  FILLER PIC X(050) VALUE "INSERT INTO auteur (nom, preno"
OCESQL  &  "m) VALUES ( $1, $2 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0004.
OCESQL     02  FILLER PIC X(059) VALUE "SELECT id_auteur FROM auteur W"
OCESQL  &  "HERE nom = $1 AND prenom = $2".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0005.
OCESQL     02  FILLER PIC X(106) VALUE "INSERT INTO livres (isbn, titr"
OCESQL  &  "e, editeur, date_pub, id_auteur, id_genre) VALUES ( $1, $2"
OCESQL  &  ", $3, $4, $5, $6 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       PROCEDURE DIVISION.
           
           DISPLAY " CONNEXION À LA BASE DE DONNÉES...".
OCESQL*EXEC SQL 
OCESQL*    CONNECT :USERNAME IDENTIFIED BY :PASSWD USING :DBNAME
OCESQL*END-EXEC.
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE USERNAME
OCESQL          BY VALUE 30
OCESQL          BY REFERENCE PASSWD
OCESQL          BY VALUE 30
OCESQL          BY REFERENCE DBNAME
OCESQL          BY VALUE 20
OCESQL     END-CALL.


           PERFORM 0100-LECTURE-ET-INSERTION-DONNEES-DEB
              THRU 0100-LECTURE-ET-INSERTION-DONNEES-FIN
              

           STOP RUN.

      ******************************************************************
      **************************PARAGRAPHES***************************** 

       0100-LECTURE-ET-INSERTION-DONNEES-DEB.
           OPEN INPUT FICHIER-LIVRES.

             PERFORM UNTIL F-LIVRES-STATUS-EOF
               READ FICHIER-LIVRES 
                  NOT AT END
  
                    MOVE F-CODE-ISBN      TO S-CODE-ISBN
                    MOVE F-TITRE          TO S-TITRE
                    MOVE F-NOM-AUTEUR     TO S-NOM-AUTEUR
                    MOVE F-PRENOM-AUTEUR  TO S-PRENOM-AUTEUR
                    MOVE F-GENRE-LIVRE    TO S-GENRE-LIVRE
                    MOVE F-ANNEE-PUB      TO S-ANNEE-PUB
                    MOVE F-EDITEUR        TO S-EDITEUR
            
               END-READ

      * INSERTION DES DONNÉES (GENRE) DANS LA TABLE GENRE     
OCESQL*    EXEC SQL
OCESQL*       INSERT INTO genre (genre)
OCESQL*       VALUES (:S-GENRE-LIVRE)
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 50
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-GENRE-LIVRE
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0001
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL

      * RÉCUPÉRATION DE L'ID GENRE    
OCESQL*    EXEC SQL 
OCESQL*       SELECT id_genre INTO :S-ID-GENRE FROM genre 
OCESQL*       WHERE genre = :S-GENRE-LIVRE
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 10
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-ID-GENRE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 50
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-GENRE-LIVRE
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0002
OCESQL          BY VALUE 1
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL

      * AFFICHAGE DE L'ID GENRE POUR CONTRÔLE     
      *     DISPLAY "Genre : " S-ID-GENRE

      * INSERTION DES DONNÉES (AUTEUR) DANS LA TABLE AUTEUR 
OCESQL*    EXEC SQL 
OCESQL*       INSERT INTO auteur (nom, prenom)
OCESQL*       VALUES (:S-NOM-AUTEUR, :S-PRENOM-AUTEUR)
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 22
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-NOM-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 22
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-PRENOM-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0003
OCESQL          BY VALUE 2
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
        
      * RÉCUPÉRATION DE L'ID AUTEUR  
OCESQL*    EXEC SQL 
OCESQL*       SELECT id_auteur INTO :S-ID-AUTEUR FROM auteur 
OCESQL*       WHERE nom = :S-NOM-AUTEUR AND prenom = :S-PRENOM-AUTEUR
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 10
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-ID-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 22
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-NOM-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 22
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-PRENOM-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0004
OCESQL          BY VALUE 2
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL

      * AFFICHAGE DE L'ID AUTEUR POUR CONTRÔLE     
      *     DISPLAY "Auteur : " S-ID-AUTEUR

      * INSERTION DES DONNÉES (LIVRE) DANS LA TABLE PRINCIPALE RELIANT
      * TOUTES LES INFORMATIONS SUR UN LIVRE 
OCESQL*    EXEC SQL
OCESQL*       INSERT INTO livres (isbn, titre, editeur, date_pub,
OCESQL*            id_auteur, id_genre)
OCESQL*       VALUES (:S-CODE-ISBN, :S-TITRE,:S-EDITEUR,:S-ANNEE-PUB,
OCESQL*              :S-ID-AUTEUR, :S-ID-GENRE)
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 13
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-CODE-ISBN
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 50
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-TITRE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 50
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-EDITEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 4
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-ANNEE-PUB
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 10
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-ID-AUTEUR
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 10
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE S-ID-GENRE
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0005
OCESQL          BY VALUE 6
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           
             END-PERFORM.
           CLOSE FICHIER-LIVRES.
      
           IF SQLCODE NOT = 0
           DISPLAY "ERREUR DE CONNEXION SQLCODE : " SQLCODE
           STOP RUN
           END-IF
           
OCESQL*    EXEC SQL COMMIT WORK END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "COMMIT" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.
       0100-LECTURE-ET-INSERTION-DONNEES-FIN.





